10/data/attachments/6c2669caa290ae06.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Alyssa_later_Friend_85924_2</nif:username>
            <nif:friendToBeRequested>soap_friends_a0190080-e586-4dc7-b364-b59b2cc15082</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>